Tekla Open API Reference for Tekla Structures 2025
Point Class
 The Point class represents a single position in 3D space.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Geometry3d.Point
 Tekla.Structures.Catalogs.CrossSectionPoint
 Tekla.Structures.Geometry3d.Vector
 Tekla.Structures.Model.ContourPoint
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public class Point : IComparable
<SerializableAttribute>
Public Class Point
	Implements IComparable
The Point type exposes the following members.
Constructors
Name | Description
Point()
 Instantiates a point with zero members.
Point(Point)
 Instantiates a point with the given other point.
Point(Double, Double)
 Instantiates a point with the given coordinates and zero Z-coordinate.
Point(Double, Double, Double)
 Instantiates a point with the given coordinates.
Top
Methods
Name | Description
AreEqual
 Compares two points and tells whether they are equal.
CompareTo
 Compares two points. To use binarysearch somekind of sorting should be used.
Equals
 Returns true if the current object and the given object are equal.
 (Overrides Object.Equals(Object).)
GetHashCode
 Returns a hash code for the point. Notice, in extremely rare cases, you might not get the same hash code for two points even though they are considered equal! This should, however, happen only in extremely rare cases!
 (Overrides Object.GetHashCode().)
ToString
 Formats the point into a string.
 (Overrides Object.ToString().)
Translate
 Translates the point using the given vector.
Zero
 Zeros all the members of the point.
Top
Operators
Name | Description
Addition
 Returns the sum of the given two points.
Equality
 Compares the given two points for similarity.
Inequality
 Compares if the two given points are not similar.
Subtraction
 Returns the difference of the given two points.
Top
Fields
Name | Description
EPSILON_SQUARED
 A boundary value for comparing if two points are similar.
HASH_SEED
 A default seed value for creating hash codes.
X
 The X-coordinate of the point.
Y
 The Y-coordinate of the point.
Z
 The Z-coordinate of the point.
Top
See Also
Reference
Tekla.Structures.Geometry3d Namespace